Repository: Porabuild/Poracode
Catalog: ios/App/App/Features/Projects/GitOperations/GitOperations.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, pl, pt_br, ru, tr, uk, vi, zh_hans

# gitOperations.title
source: Git Operations
de: Git-Operationen
es: Operaciones de Git
fr: Opérations Git
ja: Git操作
ko: Git 작업
pl: Operacje Git
pt_br: Operações do Git
ru: Операции Git
tr: Git İşlemleri
uk: Операції Git
vi: Thao tác Git
zh_hans: Git 操作

# gitOperations.commit.message
source: Commit message
de: Commit-Nachricht
es: Mensaje del commit
fr: Message de commit
ja: コミットメッセージ
ko: 커밋 메시지
pl: Wiadomość commita
pt_br: Mensagem do commit
ru: Сообщение коммита
tr: Commit iletisi
uk: Повідомлення коміту
vi: Thông điệp commit
zh_hans: 提交信息

# gitOperations.quickActions
source: Quick Actions
de: Schnellaktionen
es: Acciones rápidas
fr: Actions rapides
ja: クイック操作
ko: 빠른 작업
pl: Szybkie działania
pt_br: Ações rápidas
ru: Быстрые действия
tr: Hızlı İşlemler
uk: Швидкі дії
vi: Tác vụ nhanh
zh_hans: 快捷操作

# gitOperations.refresh
source: Refresh
de: Aktualisieren
es: Actualizar
fr: Actualiser
ja: 更新
ko: 새로 고침
pl: Odśwież
pt_br: Atualizar
ru: Обновить
tr: Yenile
uk: Оновити
vi: Làm mới
zh_hans: 刷新

# gitOperations.worktree.path
source: Worktree path
de: Worktree-Pfad
es: Ruta del árbol de trabajo
fr: Chemin de l’arbre de travail
ja: ワークツリーのパス
ko: 워크트리 경로
pl: Ścieżka drzewa roboczego
pt_br: Caminho da árvore de trabalho
ru: Путь рабочего дерева
tr: Çalışma ağacı yolu
uk: Шлях робочого дерева
vi: Đường dẫn cây làm việc
zh_hans: 工作树路径

# gitOperations.branch.create
source: Create branch
de: Branch erstellen
es: Crear rama
fr: Créer la branche
ja: ブランチを作成
ko: 브랜치 생성
pl: Utwórz gałąź
pt_br: Criar branch
ru: Создать ветку
tr: Dal oluştur
uk: Створити гілку
vi: Tạo nhánh
zh_hans: 创建分支

# gitOperations.add
source: Add
de: Hinzufügen
es: Añadir
fr: Ajouter
ja: 追加
ko: 추가
pl: Dodaj
pt_br: Adicionar
ru: Добавить
tr: Ekle
uk: Додати
vi: Thêm
zh_hans: 添加

# gitOperations.cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
pl: Anuluj
pt_br: Cancelar
ru: Отмена
tr: İptal
uk: Скасувати
vi: Hủy
zh_hans: 取消

# gitOperations.confirm
source: Continue
de: Fortfahren
es: Continuar
fr: Continuer
ja: 続ける
ko: 계속
pl: Kontynuuj
pt_br: Continuar
ru: Продолжить
tr: Devam
uk: Продовжити
vi: Tiếp tục
zh_hans: 继续

# gitOperations.confirm.title
source: Confirm Git operation
de: Git-Operation bestätigen
es: Confirmar operación de Git
fr: Confirmer l’opération Git
ja: Git操作を確認
ko: Git 작업 확인
pl: Potwierdź operację Git
pt_br: Confirmar operação do Git
ru: Подтвердить операцию Git
tr: Git işlemini onayla
uk: Підтвердити операцію Git
vi: Xác nhận thao tác Git
zh_hans: 确认 Git 操作

# gitOperations.confirm.message
source: This operation can permanently discard repository data.
de: Diese Operation kann Repository-Daten dauerhaft verwerfen.
es: Esta operación puede descartar permanentemente datos del repositorio.
fr: Cette opération peut supprimer définitivement des données du dépôt.
ja: この操作によりリポジトリのデータが完全に破棄される可能性があります。
ko: 이 작업은 저장소 데이터를 영구적으로 삭제할 수 있습니다.
pl: Ta operacja może trwale usunąć dane repozytorium.
pt_br: Esta operação pode descartar permanentemente dados do repositório.
ru: Эта операция может навсегда удалить данные репозитория.
tr: Bu işlem depo verilerini kalıcı olarak silebilir.
uk: Ця операція може назавжди видалити дані репозиторію.
vi: Thao tác này có thể xóa vĩnh viễn dữ liệu kho mã.
zh_hans: 此操作可能永久丢弃仓库数据。

# gitOperations.unavailable
source: Git operations are unavailable.
de: Git-Operationen sind nicht verfügbar.
es: Las operaciones de Git no están disponibles.
fr: Les opérations Git sont indisponibles.
ja: Git操作は利用できません。
ko: Git 작업을 사용할 수 없습니다.
pl: Operacje Git są niedostępne.
pt_br: As operações do Git não estão disponíveis.
ru: Операции Git недоступны.
tr: Git işlemleri kullanılamıyor.
uk: Операції Git недоступні.
vi: Không thể dùng các thao tác Git.
zh_hans: Git 操作不可用。

# gitOperations.busy
source: Another Git operation is running.
de: Eine andere Git-Operation wird ausgeführt.
es: Hay otra operación de Git en curso.
fr: Une autre opération Git est en cours.
ja: 別のGit操作を実行中です。
ko: 다른 Git 작업이 실행 중입니다.
pl: Trwa inna operacja Git.
pt_br: Outra operação do Git está em andamento.
ru: Выполняется другая операция Git.
tr: Başka bir Git işlemi çalışıyor.
uk: Виконується інша операція Git.
vi: Một thao tác Git khác đang chạy.
zh_hans: 另一个 Git 操作正在运行。

# gitOperations.uncertain
source: The result was uncertain. Repository state was refreshed.
de: Das Ergebnis war ungewiss. Der Repository-Status wurde aktualisiert.
es: El resultado era incierto. Se actualizó el estado del repositorio.
fr: Le résultat était incertain. L’état du dépôt a été actualisé.
ja: 結果を確認できなかったため、リポジトリの状態を更新しました。
ko: 결과가 불확실하여 저장소 상태를 새로 고쳤습니다.
pl: Wynik był niepewny. Odświeżono stan repozytorium.
pt_br: O resultado era incerto. O estado do repositório foi atualizado.
ru: Результат неясен. Состояние репозитория обновлено.
tr: Sonuç belirsizdi. Depo durumu yenilendi.
uk: Результат непевний. Стан репозиторію оновлено.
vi: Kết quả không chắc chắn. Trạng thái kho mã đã được làm mới.
zh_hans: 结果不确定，已刷新仓库状态。

# gitOperations.action.gitAbortMerge
source: Abort Merge
de: Merge abbrechen
es: Abortar fusión
fr: Abandonner la fusion
ja: マージを中止
ko: 병합 중단
pl: Przerwij scalanie
pt_br: Abortar mesclagem
ru: Прервать слияние
tr: Birleştirmeyi iptal et
uk: Перервати злиття
vi: Hủy hợp nhất
zh_hans: 中止合并

# gitOperations.action.gitAddRemote
source: Add Remote
de: Remote hinzufügen
es: Añadir remoto
fr: Ajouter un dépôt distant
ja: リモートを追加
ko: 원격 추가
pl: Dodaj zdalne repozytorium
pt_br: Adicionar remoto
ru: Добавить удалённый репозиторий
tr: Uzak depo ekle
uk: Додати віддалений репозиторій
vi: Thêm remote
zh_hans: 添加远程仓库

# gitOperations.action.gitAddWorktree
source: Add Worktree
de: Worktree hinzufügen
es: Añadir árbol de trabajo
fr: Ajouter un arbre de travail
ja: ワークツリーを追加
ko: 워크트리 추가
pl: Dodaj drzewo robocze
pt_br: Adicionar árvore de trabalho
ru: Добавить рабочее дерево
tr: Çalışma ağacı ekle
uk: Додати робоче дерево
vi: Thêm cây làm việc
zh_hans: 添加工作树

# gitOperations.action.gitDeleteBranch
source: Delete Branch
de: Branch löschen
es: Eliminar rama
fr: Supprimer la branche
ja: ブランチを削除
ko: 브랜치 삭제
pl: Usuń gałąź
pt_br: Excluir branch
ru: Удалить ветку
tr: Dalı sil
uk: Видалити гілку
vi: Xóa nhánh
zh_hans: 删除分支

# gitOperations.action.gitFetch
source: Fetch
de: Abrufen
es: Obtener cambios
fr: Récupérer
ja: フェッチ
ko: 가져오기
pl: Pobierz zmiany
pt_br: Buscar
ru: Получить изменения
tr: Getir
uk: Отримати зміни
vi: Tải về
zh_hans: 获取

# gitOperations.action.gitFinishMerge
source: Finish Merge
de: Merge abschließen
es: Finalizar fusión
fr: Terminer la fusion
ja: マージを完了
ko: 병합 완료
pl: Dokończ scalanie
pt_br: Concluir mesclagem
ru: Завершить слияние
tr: Birleştirmeyi bitir
uk: Завершити злиття
vi: Hoàn tất hợp nhất
zh_hans: 完成合并

# gitOperations.action.gitGetWorktreeOwner
source: Get Worktree Owner
de: Worktree-Besitzer abrufen
es: Obtener propietario del árbol
fr: Obtenir le propriétaire
ja: ワークツリー所有者を取得
ko: 워크트리 소유자 가져오기
pl: Pobierz właściciela drzewa
pt_br: Obter proprietário da árvore
ru: Получить владельца дерева
tr: Çalışma ağacı sahibini getir
uk: Отримати власника дерева
vi: Lấy chủ sở hữu cây
zh_hans: 获取工作树所有者

# gitOperations.action.gitGetWorktreeSourceBranch
source: Get Source Branch
de: Quell-Branch abrufen
es: Obtener rama de origen
fr: Obtenir la branche source
ja: 元のブランチを取得
ko: 원본 브랜치 가져오기
pl: Pobierz gałąź źródłową
pt_br: Obter branch de origem
ru: Получить исходную ветку
tr: Kaynak dalı getir
uk: Отримати вихідну гілку
vi: Lấy nhánh nguồn
zh_hans: 获取源分支

# gitOperations.action.gitInit
source: Initialize Repository
de: Repository initialisieren
es: Inicializar repositorio
fr: Initialiser le dépôt
ja: リポジトリを初期化
ko: 저장소 초기화
pl: Zainicjuj repozytorium
pt_br: Inicializar repositório
ru: Инициализировать репозиторий
tr: Depoyu başlat
uk: Ініціалізувати репозиторій
vi: Khởi tạo kho mã
zh_hans: 初始化仓库

# gitOperations.action.gitListBranches
source: List Branches
de: Branches auflisten
es: Listar ramas
fr: Lister les branches
ja: ブランチ一覧
ko: 브랜치 목록
pl: Wyświetl gałęzie
pt_br: Listar branches
ru: Показать ветки
tr: Dalları listele
uk: Показати гілки
vi: Liệt kê nhánh
zh_hans: 列出分支

# gitOperations.action.gitListWorktrees
source: List Worktrees
de: Worktrees auflisten
es: Listar árboles de trabajo
fr: Lister les arbres de travail
ja: ワークツリー一覧
ko: 워크트리 목록
pl: Wyświetl drzewa robocze
pt_br: Listar árvores de trabalho
ru: Показать рабочие деревья
tr: Çalışma ağaçlarını listele
uk: Показати робочі дерева
vi: Liệt kê cây làm việc
zh_hans: 列出工作树

# gitOperations.action.gitMergeToSource
source: Merge to Source
de: In Quell-Branch mergen
es: Fusionar en origen
fr: Fusionner vers la source
ja: 元のブランチへマージ
ko: 원본으로 병합
pl: Scal do źródła
pt_br: Mesclar na origem
ru: Слить в исходную ветку
tr: Kaynağa birleştir
uk: Злити у вихідну гілку
vi: Hợp nhất vào nguồn
zh_hans: 合并到源分支

# gitOperations.action.gitPruneWorktrees
source: Prune Worktrees
de: Worktrees bereinigen
es: Depurar árboles de trabajo
fr: Élaguer les arbres de travail
ja: ワークツリーを整理
ko: 워크트리 정리
pl: Wyczyść drzewa robocze
pt_br: Limpar árvores de trabalho
ru: Очистить рабочие деревья
tr: Çalışma ağaçlarını temizle
uk: Очистити робочі дерева
vi: Dọn cây làm việc
zh_hans: 清理工作树

# gitOperations.action.gitPull
source: Pull
de: Pullen
es: Descargar
fr: Tirer
ja: プル
ko: 풀
pl: Ściągnij
pt_br: Baixar
ru: Загрузить
tr: Çek
uk: Завантажити
vi: Kéo về
zh_hans: 拉取

# gitOperations.action.gitPullFromSource
source: Pull from Source
de: Aus Quelle pullen
es: Descargar del origen
fr: Tirer depuis la source
ja: 元のブランチからプル
ko: 원본에서 풀
pl: Ściągnij ze źródła
pt_br: Baixar da origem
ru: Загрузить из исходной ветки
tr: Kaynaktan çek
uk: Завантажити з вихідної гілки
vi: Kéo từ nguồn
zh_hans: 从源分支拉取

# gitOperations.action.gitPullRebase
source: Pull with Rebase
de: Mit Rebase pullen
es: Descargar con rebase
fr: Tirer avec rebase
ja: リベースしてプル
ko: 리베이스로 풀
pl: Ściągnij z rebase
pt_br: Baixar com rebase
ru: Загрузить с перебазированием
tr: Rebase ile çek
uk: Завантажити з перебазуванням
vi: Kéo với rebase
zh_hans: 变基拉取

# gitOperations.action.gitPush
source: Push
de: Pushen
es: Subir
fr: Pousser
ja: プッシュ
ko: 푸시
pl: Wypchnij
pt_br: Enviar
ru: Отправить
tr: Gönder
uk: Надіслати
vi: Đẩy lên
zh_hans: 推送

# gitOperations.action.gitRemoveWorktree
source: Remove Worktree
de: Worktree entfernen
es: Eliminar árbol de trabajo
fr: Supprimer l’arbre de travail
ja: ワークツリーを削除
ko: 워크트리 제거
pl: Usuń drzewo robocze
pt_br: Remover árvore de trabalho
ru: Удалить рабочее дерево
tr: Çalışma ağacını kaldır
uk: Видалити робоче дерево
vi: Xóa cây làm việc
zh_hans: 移除工作树

# gitOperations.action.gitRevert
source: Revert File
de: Datei zurücksetzen
es: Revertir archivo
fr: Rétablir le fichier
ja: ファイルを元に戻す
ko: 파일 되돌리기
pl: Cofnij plik
pt_br: Reverter arquivo
ru: Отменить изменения файла
tr: Dosyayı geri al
uk: Скасувати зміни файла
vi: Hoàn tác tệp
zh_hans: 还原文件

# gitOperations.action.gitRevertAll
source: Revert All
de: Alle zurücksetzen
es: Revertir todo
fr: Tout rétablir
ja: すべて元に戻す
ko: 모두 되돌리기
pl: Cofnij wszystko
pt_br: Reverter tudo
ru: Отменить все изменения
tr: Tümünü geri al
uk: Скасувати всі зміни
vi: Hoàn tác tất cả
zh_hans: 还原全部

# gitOperations.action.gitStage
source: Stage File
de: Datei stagen
es: Preparar archivo
fr: Indexer le fichier
ja: ファイルをステージ
ko: 파일 스테이징
pl: Dodaj plik do indeksu
pt_br: Preparar arquivo
ru: Индексировать файл
tr: Dosyayı stage et
uk: Індексувати файл
vi: Đưa tệp vào stage
zh_hans: 暂存文件

# gitOperations.action.gitStageAll
source: Stage All
de: Alle stagen
es: Preparar todo
fr: Tout indexer
ja: すべてステージ
ko: 모두 스테이징
pl: Dodaj wszystko do indeksu
pt_br: Preparar tudo
ru: Индексировать всё
tr: Tümünü stage et
uk: Індексувати все
vi: Đưa tất cả vào stage
zh_hans: 暂存全部

# gitOperations.action.gitSwitchBranch
source: Switch Branch
de: Branch wechseln
es: Cambiar de rama
fr: Changer de branche
ja: ブランチを切り替え
ko: 브랜치 전환
pl: Przełącz gałąź
pt_br: Trocar de branch
ru: Переключить ветку
tr: Dal değiştir
uk: Перемкнути гілку
vi: Chuyển nhánh
zh_hans: 切换分支

# gitOperations.action.gitSync
source: Sync
de: Synchronisieren
es: Sincronizar
fr: Synchroniser
ja: 同期
ko: 동기화
pl: Synchronizuj
pt_br: Sincronizar
ru: Синхронизировать
tr: Eşitle
uk: Синхронізувати
vi: Đồng bộ
zh_hans: 同步

# gitOperations.action.gitSyncRebase
source: Sync with Rebase
de: Mit Rebase synchronisieren
es: Sincronizar con rebase
fr: Synchroniser avec rebase
ja: リベースして同期
ko: 리베이스로 동기화
pl: Synchronizuj z rebase
pt_br: Sincronizar com rebase
ru: Синхронизировать с перебазированием
tr: Rebase ile eşitle
uk: Синхронізувати з перебазуванням
vi: Đồng bộ với rebase
zh_hans: 变基同步

# gitOperations.action.gitUnstage
source: Unstage File
de: Datei unstagen
es: Quitar archivo del área
fr: Désindexer le fichier
ja: ファイルのステージを解除
ko: 파일 스테이징 해제
pl: Usuń plik z indeksu
pt_br: Remover arquivo da preparação
ru: Убрать файл из индекса
tr: Dosyayı stage’den çıkar
uk: Прибрати файл з індексу
vi: Bỏ tệp khỏi stage
zh_hans: 取消暂存文件

# gitOperations.action.gitUnstageAll
source: Unstage All
de: Alle unstagen
es: Quitar todo del área
fr: Tout désindexer
ja: すべてのステージを解除
ko: 모두 스테이징 해제
pl: Usuń wszystko z indeksu
pt_br: Remover tudo da preparação
ru: Очистить индекс
tr: Tümünü stage’den çıkar
uk: Очистити індекс
vi: Bỏ tất cả khỏi stage
zh_hans: 取消暂存全部

# gitOperations.action.gitWorktreeStatusBatch
source: Refresh Worktree Status
de: Worktree-Status aktualisieren
es: Actualizar estado de árboles
fr: Actualiser l’état des arbres
ja: ワークツリー状態を更新
ko: 워크트리 상태 새로 고침
pl: Odśwież stan drzew
pt_br: Atualizar estado das árvores
ru: Обновить состояние деревьев
tr: Çalışma ağacı durumunu yenile
uk: Оновити стан дерев
vi: Làm mới trạng thái cây
zh_hans: 刷新工作树状态

# gitOperations.repository
source: Repository
es: Repositorio
fr: Dépôt
ja: リポジトリ
ko: 저장소
pl: Repozytorium
pt_br: Repositório
ru: Репозиторий
tr: Depo
uk: Репозиторій
vi: Kho mã
zh_hans: 仓库

# gitOperations.branches
source: Branches
es: Ramas
ja: ブランチ
ko: 브랜치
pl: Gałęzie
ru: Ветки
tr: Dallar
uk: Гілки
vi: Nhánh
zh_hans: 分支

# gitOperations.worktrees
source: Worktrees
es: Árboles de trabajo
fr: Arbres de travail
ja: ワークツリー
ko: 워크트리
pl: Drzewa robocze
pt_br: Árvores de trabalho
ru: Рабочие деревья
tr: Çalışma ağaçları
uk: Робочі дерева
vi: Cây làm việc
zh_hans: 工作树

# gitOperations.commit
source: Commit
es: Crear commit
fr: Valider
ja: コミット
ko: 커밋
pl: Utwórz commit
pt_br: Criar commit
ru: Создать коммит
tr: Commit oluştur
uk: Створити коміт
vi: Tạo commit
zh_hans: 提交

# gitOperations.remote.name
source: Remote name
es: Nombre del remoto
fr: Nom du dépôt distant
ja: リモート名
ko: 원격 이름
pl: Nazwa zdalnego repozytorium
pt_br: Nome do remoto
ru: Имя удалённого репозитория
tr: Uzak depo adı
uk: Назва віддаленого репозиторію
vi: Tên remote
zh_hans: 远程名称

# gitOperations.remote.url
source: Remote URL
es: URL del remoto
fr: URL du dépôt distant
ja: リモートURL
ko: 원격 URL
pl: URL zdalnego repozytorium
pt_br: URL do remoto
ru: URL удалённого репозитория
tr: Uzak depo URL’si
uk: URL віддаленого репозиторію
vi: URL remote
zh_hans: 远程 URL

# gitOperations.branch.name
source: Branch name
es: Nombre de la rama
fr: Nom de la branche
ja: ブランチ名
ko: 브랜치 이름
pl: Nazwa gałęzi
pt_br: Nome da branch
ru: Имя ветки
tr: Dal adı
uk: Назва гілки
vi: Tên nhánh
zh_hans: 分支名称

# gitOperations.branch.format
source: Branch: %1$@
es: Rama: %1$@
fr: Branche : %1$@
ja: ブランチ：%1$@
ko: 브랜치: %1$@
pl: Gałąź: %1$@
ru: Ветка: %1$@
tr: Dal: %1$@
uk: Гілка: %1$@
vi: Nhánh: %1$@
zh_hans: 分支：%1$@

# gitOperations.worktree.format
source: Worktree: %1$@
es: Árbol de trabajo: %1$@
fr: Arbre de travail : %1$@
ja: ワークツリー：%1$@
ko: 워크트리: %1$@
pl: Drzewo robocze: %1$@
pt_br: Árvore de trabalho: %1$@
ru: Рабочее дерево: %1$@
tr: Çalışma ağacı: %1$@
uk: Робоче дерево: %1$@
vi: Cây làm việc: %1$@
zh_hans: 工作树：%1$@

# gitOperations.action.gitCommit
source: Commit
es: Crear commit
fr: Valider
ja: コミット
ko: 커밋
pl: Utwórz commit
pt_br: Criar commit
ru: Создать коммит
tr: Commit oluştur
uk: Створити коміт
vi: Tạo commit
zh_hans: 提交
